{"keras_version": "2.2.2", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["conv2d_21", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"sparse": false, "name": "input_3", "dtype": "float32", "batch_input_shape": [null, 100, 100, 1]}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"bias_regularizer": null, "name": "conv2d_15", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_7", "config": {"name": "max_pooling2d_7", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"bias_regularizer": null, "name": "conv2d_16", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 8, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_8", "config": {"name": "max_pooling2d_8", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"bias_regularizer": null, "name": "conv2d_17", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 8, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_9", "config": {"name": "max_pooling2d_9", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"bias_regularizer": null, "name": "conv2d_18", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 8, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_7", "config": {"name": "up_sampling2d_7", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"bias_regularizer": null, "name": "conv2d_19", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 8, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_8", "config": {"name": "up_sampling2d_8", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"bias_regularizer": null, "name": "conv2d_20", "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_9", "config": {"name": "up_sampling2d_9", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["up_sampling2d_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"bias_regularizer": null, "name": "conv2d_21", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 1, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "sigmoid"}}]}}