{"config": {"name": "model_9", "output_layers": [["conv2d_70", 0, 0]], "input_layers": [["input_11", 0, 0]], "layers": [{"name": "input_11", "config": {"batch_input_shape": [null, 50, 50, 1], "dtype": "float32", "name": "input_11", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_64", "config": {"name": "conv2d_64", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_28", "config": {"name": "max_pooling2d_28", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv2d_64", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_65", "config": {"name": "conv2d_65", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_28", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_29", "config": {"name": "max_pooling2d_29", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv2d_65", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_66", "config": {"name": "conv2d_66", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_29", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_30", "config": {"name": "max_pooling2d_30", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv2d_66", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_67", "config": {"name": "conv2d_67", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_30", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "up_sampling2d_28", "config": {"name": "up_sampling2d_28", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_67", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "conv2d_68", "config": {"name": "conv2d_68", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same"}, "inbound_nodes": [[["up_sampling2d_28", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "up_sampling2d_29", "config": {"name": "up_sampling2d_29", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_68", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "conv2d_69", "config": {"name": "conv2d_69", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["up_sampling2d_29", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "up_sampling2d_30", "config": {"name": "up_sampling2d_30", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_69", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "conv2d_70", "config": {"name": "conv2d_70", "activation": "sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 1, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["up_sampling2d_30", 0, 0, {}]]], "class_name": "Conv2D"}]}, "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model"}