{"keras_version": "2.2.2", "config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 50, 50, 1], "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "name": "conv2d_1", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 8, "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 8, "name": "conv2d_3", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 8, "name": "conv2d_4", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last"}, "name": "up_sampling2d_1", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 8, "name": "conv2d_5", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last"}, "name": "up_sampling2d_2", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "name": "conv2d_6", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_3", "data_format": "channels_last"}, "name": "up_sampling2d_3", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 1, "name": "conv2d_7", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "name": "conv2d_7", "class_name": "Conv2D"}], "name": "model_1", "output_layers": [["conv2d_7", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}