{"backend": "tensorflow", "keras_version": "2.2.2", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_7", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 50, 50, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_1", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "filters": 8, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_2", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "filters": 8, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_3", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "filters": 8, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_4", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"name": "conv2d_5", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "filters": 8, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_5", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"name": "conv2d_6", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_6", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "up_sampling2d_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"name": "conv2d_7", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "sigmoid", "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "filters": 1, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "name": "conv2d_7", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}]}, "class_name": "Model"}