{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_7", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50, 1], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"filters": 16, "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_constraint": null, "name": "conv2d_5", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"class_name": "Conv2D", "config": {"filters": 16, "kernel_constraint": null, "name": "conv2d_6", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "up_sampling2d_3"}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_constraint": null, "name": "conv2d_7", "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_7"}]}, "keras_version": "2.2.2"}